#+TITLE: Implement algorithms in Modern Fortran.
#+AUTHOR: Yuma Osada
#+DATE: {{{time(%Y-%m-%d)}}}.
#+LaTeX_header: \usepackage{minted}
#+LaTeX_header: \usepackage{cleveref}
#+macro: src_line line [[($1)]]
#+options: ^:{}
#+options: toc:t H:4 num:4
***** testコードブロック
#+name: test-ref_string-merge-sort
#+begin_src fortran :exports code :results output :cache yes :noweb yes
  <<ref_string-module>>
  <<ref_string-merge-sort-module>>
  <<ref_string-merge-sort-test>>
#+end_src

#+RESULTS[65a4576aa867029b4fb0f9f9c3562fa9e4bc8543]: test-ref_string-merge-sort
: a      ab     abc    ba     bb     z      zabcd
: zabcd  z      bb     ba     abc    ab     a

***** testコードブロック
#+name: test-ref_string-btree
#+begin_src fortran :exports code :results output :cache yes :noweb yes
  <<ref_string-module>>
  <<ref_string-btree-module>>
  <<ref_string-btree-test>>
#+end_src

#+RESULTS[88b254bd9688ac19ffba7d29a89fbee2480b4237]: test-ref_string-btree
: 7

**** test
#+name: linked_list-test
#+begin_src fortran :exports code :tangle "test/test_linked_list.f90"
  program test_linked_list
    use, intrinsic :: iso_fortran_env
    use linked_list_m
    implicit none
    integer(int32) :: i
    type(linked_list_int32_head) :: lst_i32
    do i = 1, 10
       call lst_i32%add(i)
    end do
    print*, lst_i32%search(3)
    print*, lst_i32%search(-1)
  end program test_linked_list
#+end_src
#+name: test-linked_list
#+begin_src fortran :exports code :results output :noweb no-export :cache yes
<<linked_list-module>>
<<linked_list-test>>
#+end_src

#+RESULTS[94846b1ec8b475a77907acdcedad9a0da205232b]: test-linked_list
: T
: F

*** test
#+name: stream_out-test
#+begin_src fortran :exports code :tangle "test/test_steam_out.f90"
  program test_stream_out
    use, intrinsic :: iso_fortran_env
    use stream_out_m, cstream => const_stream
    implicit none
    type(stream_out) :: myout
    myout = stdout
    call myout%sep(" ")
    cstream = stdout .o. 3 .o. 4_int64 .o. 30.2/3 .o. 40.6d40/3 .o. endl
    cstream = myout  .o. 3 .o. 4_int64 .o. 30.2/3 .o. 40.6d40/3 .o. endl
    cstream = stderr .o. 3 .o. 4_int64 .o. 30.2/3 .o. 40.6d40/3 .o. endl
    cstream = stdout .o. 2 .o. 4.2 .o. .true. .o. "hi" .o. endl
  end program test_stream_out
#+end_src
#+name: test-stream_out
#+begin_src fortran :flags -g -fbacktrace :exports code :results output :noweb no-export :cache yes
<<stream_out-module>>
<<stream_out-test>>
#+end_src

#+RESULTS[7180d27cac49410c73102321bde729aff897011d]: test-stream_out
: 3410.066666601.3533333333333333E+041
: 3 4 10.06666660 1.3533333333333333E+041
: 24.19999981Thi
